{
    "version": "https://jsonfeed.org/version/1",
    "title": "CUMSA",
    "description": "",
    "home_page_url": "file:////Users/xinshuo/Documents/Publii/sites/cumsa/preview",
    "feed_url": "file:////Users/xinshuo/Documents/Publii/sites/cumsa/preview/feed.json",
    "user_comment": "",
    "author": {
        "name": "Zeyu"
    },
    "items": [
        {
            "id": "file:////Users/xinshuo/Documents/Publii/sites/cumsa/preview/about-cumsa.html",
            "url": "file:////Users/xinshuo/Documents/Publii/sites/cumsa/preview/about-cumsa.html",
            "title": "Cambridge University Malaysia and Singapore Association",
            "summary": "Founded in 1948, CUMSA aims to bring together members of the Malaysian and Singaporean communities in Cambridge, fostering friendships and providing a home away&hellip;",
            "content_html": "<p> </p>\n<h1> </h1>\n<h1 class=\"wp-block-heading has-text-align-left has-large-font-size\"><strong>Join a close-knit community of Malaysians and Singaporeans in the heart of Cambridge</strong></h1>\n<p>Founded in 1948, CUMSA aims to bring together members of the Malaysian and Singaporean communities in Cambridge, fostering friendships and providing a home away from home to Malaysians and Singaporeans alike. Over the years, CUMSA has built a strong network of current students and alumni in Singapore, the United Kingdom and globally.</p>\n<p>CUMSA holds a number of events throughout the year for its members and alumni with the intention of creating a social environment with a South-East Asian air. We also hold career-focused events for our members in a wide variety of industries.</p>\n<p><a href=\"https://membership.cumsa.org\"  class=\"extlink extlink-icon-1 \"  >Sign up for membership</a></p>\n<figure class=\"post__image post__image--wide\"><img loading=\"lazy\"  style=\"margin-bottom: 1.37143rem; margin-right: 1.37143rem; outline: 3px solid rgba(var(--color-primary-rgb), 0.55) !important;\" src=\"file:///Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/photo_2024-11-15-19.34.31-2.jpeg\" alt=\"\" width=\"467\" height=\"311\" sizes=\"(max-width: 1024px) 100vw, 1024px\" srcset=\"file:///Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/responsive/photo_2024-11-15-19.34.31-2-xs.jpeg 300w ,file:///Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/responsive/photo_2024-11-15-19.34.31-2-sm.jpeg 480w ,file:///Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/responsive/photo_2024-11-15-19.34.31-2-md.jpeg 768w ,file:///Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/responsive/photo_2024-11-15-19.34.31-2-lg.jpeg 1024w\"></figure>\n<h1 class=\"wp-block-heading\"><strong>Where we come from</strong></h1>\n<p>CUMSA was founded in the Michaelmas term of 1948. Then known as the Cambridge University Malayan Association, it brought together a small community, worlds away from home.</p>\n<p>CUMSA’s founding committee included former Minister Mentor Lee Kuan Yew (as President), and former Chief Justice Yong Pung How (as Secretary). Over 60 years since, many Malaysians and Singaporeans have contributed to the organisation – a list which includes Singapore’s current Prime Minister Lee Hsien Loong, and former Minister for Foreign Affairs George Yeo.</p>\n<p>When Singapore gained independence from Malaysia in 1965, CUMSA did not similarly divide. The association persevered as a common meeting place for people of both nationalities. Though relationships between the communities were sometimes fraught, the years of precedence spoke volumes when it came time to make those difficult decisions about remaining under one organisation. Though a separate Malaysian association was founded in 1994, we still proudly count a number of Malaysian members among our ranks, along with people of many other nationalities.</p>\n<h1 class=\"wp-block-heading\"><strong>What we are</strong></h1>\n<p>The organisation continues to bring together members of the Malaysian and Singaporean communities, albeit on a slightly larger scale. From 12 students at our founding, the organisation has grown to over 400. With this, we have adapted, and our service to the Malaysian and Singaporean community is now multi-faceted.</p>\n<p>We hold a number of events throughout the year with the intention of creating a social environment with a familiar Southeast Asian air. Events include the annual Freshers’ Orientation, Singapore Festival and Ski Trip, amongst many others.</p>\n<p>We also aim to serve the community as a platform for discussion, with access to – and the opportunity to share – informed opinions. Studying overseas so often changes perspectives regarding our place in the world and it is only prudent that we provide support for this through speakers’ events and forums for discussion.</p>\n<p>We not only aid incoming students in adjusting to their new environment, but also ensure there is a community to which one can turn throughout their time here – never always needed, but always there.</p>",
            "image": "file:////Users/xinshuo/Documents/Publii/sites/cumsa/preview/media/posts/5/photo_2024-11-06-16.03.29.jpeg",
            "author": {
                "name": "Zeyu"
            },
            "tags": [
            ],
            "date_published": "2024-11-06T16:59:17+01:00",
            "date_modified": "2024-12-15T02:04:54+01:00"
        }
    ]
}
